espressif/esp-idf/components/soc/esp32s3/include/soc/sensitive_struct.h
// Copyright 2017-2021 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_SENSITIVE_STRUCT_H_
#define _SOC_SENSITIVE_STRUCT_H_


#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

typedef volatile struct {
    union {
        struct {
            uint32_t cache_dataarray_connect_lock  :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } cache_dataarray_connect_0;
    union {
        struct {
            uint32_t cache_dataarray_connect_flatten:    8;
            uint32_t reserved8                     :    24;
        };
        uint32_t val;
    } cache_dataarray_connect_1;
    union {
        struct {
            uint32_t apb_peripheral_access_lock    :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } apb_peripheral_access_0;
    union {
        struct {
            uint32_t apb_peripheral_access_split_burst:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } apb_peripheral_access_1;
    union {
        struct {
            uint32_t internal_sram_usage_lock      :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } internal_sram_usage_0;
    union {
        struct {
            uint32_t internal_sram_icache_usage    :    2;
            uint32_t internal_sram_dcache_usage    :    2;
            uint32_t internal_sram_cpu_usage       :    7;
            uint32_t reserved11                    :    21;
        };
        uint32_t val;
    } internal_sram_usage_1;
    union {
        struct {
            uint32_t internal_sram_core0_trace_usage:    7;
            uint32_t internal_sram_core1_trace_usage:    7;
            uint32_t internal_sram_core0_trace_alloc:    2;
            uint32_t internal_sram_core1_trace_alloc:    2;
            uint32_t reserved18                    :    14;
        };
        uint32_t val;
    } internal_sram_usage_2;
    union {
        struct {
            uint32_t internal_sram_mac_dump_usage  :    4;
            uint32_t reserved4                     :    28;
        };
        uint32_t val;
    } internal_sram_usage_3;
    union {
        struct {
            uint32_t internal_sram_log_usage       :    7;
            uint32_t reserved7                     :    25;
        };
        uint32_t val;
    } internal_sram_usage_4;
    union {
        struct {
            uint32_t retention_disable             :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } retention_disable;
    union {
        struct {
            uint32_t cache_tag_access_lock         :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } cache_tag_access_0;
    union {
        struct {
            uint32_t pro_i_tag_rd_acs              :    1;
            uint32_t pro_i_tag_wr_acs              :    1;
            uint32_t pro_d_tag_rd_acs              :    1;
            uint32_t pro_d_tag_wr_acs              :    1;
            uint32_t reserved4                     :    28;
        };
        uint32_t val;
    } cache_tag_access_1;
    union {
        struct {
            uint32_t cache_mmu_access_lock         :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } cache_mmu_access_0;
    union {
        struct {
            uint32_t pro_mmu_rd_acs                :    1;
            uint32_t pro_mmu_wr_acs                :    1;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } cache_mmu_access_1;
    union {
        struct {
            uint32_t dma_apbperi_spi2_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_spi2_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_spi2_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_spi2_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_spi2_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_spi2_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_spi2_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_spi2_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_spi2_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_spi3_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_spi3_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_spi3_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_spi3_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_spi3_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_spi3_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_spi3_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_spi3_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_spi3_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_uhci0_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_uhci0_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_uhci0_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_uhci0_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_uhci0_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_uhci0_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_uhci0_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_uhci0_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_uhci0_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_i2s0_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_i2s0_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_i2s0_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_i2s0_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_i2s0_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_i2s0_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_i2s0_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_i2s0_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_i2s0_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_i2s1_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_i2s1_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_i2s1_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_i2s1_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_i2s1_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_i2s1_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_i2s1_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_i2s1_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_i2s1_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_mac_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_mac_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_mac_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_mac_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_mac_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_mac_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_mac_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_mac_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_mac_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_backup_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_backup_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_backup_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_backup_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_backup_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_backup_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_backup_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_backup_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_backup_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_aes_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_aes_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_aes_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_aes_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_aes_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_aes_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_aes_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_aes_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_aes_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_sha_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_sha_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_sha_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_sha_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_sha_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_sha_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_sha_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_sha_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_sha_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_adc_dac_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_adc_dac_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_adc_dac_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_adc_dac_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_adc_dac_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_adc_dac_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_adc_dac_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_adc_dac_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_adc_dac_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_rmt_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_rmt_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_rmt_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_rmt_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_rmt_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_rmt_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_rmt_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_rmt_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_rmt_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_lcd_cam_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_lcd_cam_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_lcd_cam_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_lcd_cam_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_lcd_cam_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_lcd_cam_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_lcd_cam_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_lcd_cam_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_lcd_cam_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_usb_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_usb_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_usb_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_usb_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_usb_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_usb_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_usb_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_usb_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_usb_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_lc_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_lc_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_lc_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_lc_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_lc_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_lc_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_lc_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_lc_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_lc_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_sdio_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_sdio_pms_constrain_0;
    union {
        struct {
            uint32_t dma_apbperi_sdio_pms_constrain_sram_pms_0:    2;
            uint32_t dma_apbperi_sdio_pms_constrain_sram_pms_1:    2;
            uint32_t dma_apbperi_sdio_pms_constrain_sram_pms_2:    2;
            uint32_t dma_apbperi_sdio_pms_constrain_sram_pms_3:    2;
            uint32_t dma_apbperi_sdio_pms_constrain_sram_cachedataarray_pms_0:    2;
            uint32_t dma_apbperi_sdio_pms_constrain_sram_cachedataarray_pms_1:    2;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } dma_apbperi_sdio_pms_constrain_1;
    union {
        struct {
            uint32_t dma_apbperi_pms_monitor_lock  :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } dma_apbperi_pms_monitor_0;
    union {
        struct {
            uint32_t dma_apbperi_pms_monitor_violate_clr:    1;
            uint32_t dma_apbperi_pms_monitor_violate_en:    1;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } dma_apbperi_pms_monitor_1;
    union {
        struct {
            uint32_t dma_apbperi_pms_monitor_violate_intr:    1;
            uint32_t dma_apbperi_pms_monitor_violate_status_world:    2;
            uint32_t dma_apbperi_pms_monitor_violate_status_addr:    22;
            uint32_t reserved25                    :    7;
        };
        uint32_t val;
    } dma_apbperi_pms_monitor_2;
    union {
        struct {
            uint32_t dma_apbperi_pms_monitor_violate_status_wr:    1;
            uint32_t dma_apbperi_pms_monitor_violate_status_byteen:    16;
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } dma_apbperi_pms_monitor_3;
    union {
        struct {
            uint32_t core_x_iram0_dram0_dma_split_line_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_x_iram0_dram0_dma_split_line_constrain_0;
    union {
        struct {
            uint32_t core_x_iram0_dram0_dma_sram_category_0:    2;
            uint32_t core_x_iram0_dram0_dma_sram_category_1:    2;
            uint32_t core_x_iram0_dram0_dma_sram_category_2:    2;
            uint32_t core_x_iram0_dram0_dma_sram_category_3:    2;
            uint32_t core_x_iram0_dram0_dma_sram_category_4:    2;
            uint32_t core_x_iram0_dram0_dma_sram_category_5:    2;
            uint32_t core_x_iram0_dram0_dma_sram_category_6:    2;
            uint32_t core_x_iram0_dram0_dma_sram_splitaddr:    8;
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_x_iram0_dram0_dma_split_line_constrain_1;
    union {
        struct {
            uint32_t core_x_iram0_sram_line_0_category_0:    2;
            uint32_t core_x_iram0_sram_line_0_category_1:    2;
            uint32_t core_x_iram0_sram_line_0_category_2:    2;
            uint32_t core_x_iram0_sram_line_0_category_3:    2;
            uint32_t core_x_iram0_sram_line_0_category_4:    2;
            uint32_t core_x_iram0_sram_line_0_category_5:    2;
            uint32_t core_x_iram0_sram_line_0_category_6:    2;
            uint32_t core_x_iram0_sram_line_0_splitaddr:    8;
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_x_iram0_dram0_dma_split_line_constrain_2;
    union {
        struct {
            uint32_t core_x_iram0_sram_line_1_category_0:    2;
            uint32_t core_x_iram0_sram_line_1_category_1:    2;
            uint32_t core_x_iram0_sram_line_1_category_2:    2;
            uint32_t core_x_iram0_sram_line_1_category_3:    2;
            uint32_t core_x_iram0_sram_line_1_category_4:    2;
            uint32_t core_x_iram0_sram_line_1_category_5:    2;
            uint32_t core_x_iram0_sram_line_1_category_6:    2;
            uint32_t core_x_iram0_sram_line_1_splitaddr:    8;
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_x_iram0_dram0_dma_split_line_constrain_3;
    union {
        struct {
            uint32_t core_x_dram0_dma_sram_line_0_category_0:    2;
            uint32_t core_x_dram0_dma_sram_line_0_category_1:    2;
            uint32_t core_x_dram0_dma_sram_line_0_category_2:    2;
            uint32_t core_x_dram0_dma_sram_line_0_category_3:    2;
            uint32_t core_x_dram0_dma_sram_line_0_category_4:    2;
            uint32_t core_x_dram0_dma_sram_line_0_category_5:    2;
            uint32_t core_x_dram0_dma_sram_line_0_category_6:    2;
            uint32_t core_x_dram0_dma_sram_line_0_splitaddr:    8;
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_x_iram0_dram0_dma_split_line_constrain_4;
    union {
        struct {
            uint32_t core_x_dram0_dma_sram_line_1_category_0:    2;
            uint32_t core_x_dram0_dma_sram_line_1_category_1:    2;
            uint32_t core_x_dram0_dma_sram_line_1_category_2:    2;
            uint32_t core_x_dram0_dma_sram_line_1_category_3:    2;
            uint32_t core_x_dram0_dma_sram_line_1_category_4:    2;
            uint32_t core_x_dram0_dma_sram_line_1_category_5:    2;
            uint32_t core_x_dram0_dma_sram_line_1_category_6:    2;
            uint32_t core_x_dram0_dma_sram_line_1_splitaddr:    8;
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_x_iram0_dram0_dma_split_line_constrain_5;
    union {
        struct {
            uint32_t core_x_iram0_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_x_iram0_pms_constrain_0;
    union {
        struct {
            uint32_t core_x_iram0_pms_constrain_sram_world_1_pms_0:    3;
            uint32_t core_x_iram0_pms_constrain_sram_world_1_pms_1:    3;
            uint32_t core_x_iram0_pms_constrain_sram_world_1_pms_2:    3;
            uint32_t core_x_iram0_pms_constrain_sram_world_1_pms_3:    3;
            uint32_t core_x_iram0_pms_constrain_sram_world_1_cachedataarray_pms_0:    3;
            uint32_t core_x_iram0_pms_constrain_sram_world_1_cachedataarray_pms_1:    3;
            uint32_t core_x_iram0_pms_constrain_rom_world_1_pms:    3;
            uint32_t reserved21                    :    11;
        };
        uint32_t val;
    } core_x_iram0_pms_constrain_1;
    union {
        struct {
            uint32_t core_x_iram0_pms_constrain_sram_world_0_pms_0:    3;
            uint32_t core_x_iram0_pms_constrain_sram_world_0_pms_1:    3;
            uint32_t core_x_iram0_pms_constrain_sram_world_0_pms_2:    3;
            uint32_t core_x_iram0_pms_constrain_sram_world_0_pms_3:    3;
            uint32_t core_x_iram0_pms_constrain_sram_world_0_cachedataarray_pms_0:    3;
            uint32_t core_x_iram0_pms_constrain_sram_world_0_cachedataarray_pms_1:    3;
            uint32_t core_x_iram0_pms_constrain_rom_world_0_pms:    3;
            uint32_t reserved21                    :    11;
        };
        uint32_t val;
    } core_x_iram0_pms_constrain_2;
    union {
        struct {
            uint32_t core_0_iram0_pms_monitor_lock :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_0_iram0_pms_monitor_0;
    union {
        struct {
            uint32_t core_0_iram0_pms_monitor_violate_clr:    1;
            uint32_t core_0_iram0_pms_monitor_violate_en:    1;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } core_0_iram0_pms_monitor_1;
    union {
        struct {
            uint32_t core_0_iram0_pms_monitor_violate_intr:    1;
