espressif/esp-idf/components/soc/esp32s3/include/soc/sensitive_struct.h
            uint32_t core_0_iram0_pms_monitor_violate_status_wr:    1;
            uint32_t core_0_iram0_pms_monitor_violate_status_loadstore:    1;
            uint32_t core_0_iram0_pms_monitor_violate_status_world:    2;
            uint32_t core_0_iram0_pms_monitor_violate_status_addr:    24;
            uint32_t reserved29                    :    3;
        };
        uint32_t val;
    } core_0_iram0_pms_monitor_2;
    union {
        struct {
            uint32_t core_1_iram0_pms_monitor_lock :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_1_iram0_pms_monitor_0;
    union {
        struct {
            uint32_t core_1_iram0_pms_monitor_violate_clr:    1;
            uint32_t core_1_iram0_pms_monitor_violate_en:    1;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } core_1_iram0_pms_monitor_1;
    union {
        struct {
            uint32_t core_1_iram0_pms_monitor_violate_intr:    1;
            uint32_t core_1_iram0_pms_monitor_violate_status_wr:    1;
            uint32_t core_1_iram0_pms_monitor_violate_status_loadstore:    1;
            uint32_t core_1_iram0_pms_monitor_violate_status_world:    2;
            uint32_t core_1_iram0_pms_monitor_violate_status_addr:    24;
            uint32_t reserved29                    :    3;
        };
        uint32_t val;
    } core_1_iram0_pms_monitor_2;
    union {
        struct {
            uint32_t core_x_dram0_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_x_dram0_pms_constrain_0;
    union {
        struct {
            uint32_t core_x_dram0_pms_constrain_sram_world_0_pms_0:    2;
            uint32_t core_x_dram0_pms_constrain_sram_world_0_pms_1:    2;
            uint32_t core_x_dram0_pms_constrain_sram_world_0_pms_2:    2;
            uint32_t core_x_dram0_pms_constrain_sram_world_0_pms_3:    2;
            uint32_t core_x_dram0_pms_constrain_sram_world_0_cachedataarray_pms_0:    2;
            uint32_t core_x_dram0_pms_constrain_sram_world_0_cachedataarray_pms_1:    2;
            uint32_t core_x_dram0_pms_constrain_sram_world_1_pms_0:    2;
            uint32_t core_x_dram0_pms_constrain_sram_world_1_pms_1:    2;
            uint32_t core_x_dram0_pms_constrain_sram_world_1_pms_2:    2;
            uint32_t core_x_dram0_pms_constrain_sram_world_1_pms_3:    2;
            uint32_t core_x_dram0_pms_constrain_sram_world_1_cachedataarray_pms_0:    2;
            uint32_t core_x_dram0_pms_constrain_sram_world_1_cachedataarray_pms_1:    2;
            uint32_t core_x_dram0_pms_constrain_rom_world_0_pms:    2;
            uint32_t core_x_dram0_pms_constrain_rom_world_1_pms:    2;
            uint32_t reserved28                    :    4;
        };
        uint32_t val;
    } core_x_dram0_pms_constrain_1;
    union {
        struct {
            uint32_t core_0_dram0_pms_monitor_lock :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_0_dram0_pms_monitor_0;
    union {
        struct {
            uint32_t core_0_dram0_pms_monitor_violate_clr:    1;
            uint32_t core_0_dram0_pms_monitor_violate_en:    1;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } core_0_dram0_pms_monitor_1;
    union {
        struct {
            uint32_t core_0_dram0_pms_monitor_violate_intr:    1;
            uint32_t core_0_dram0_pms_monitor_violate_status_lock:    1;
            uint32_t core_0_dram0_pms_monitor_violate_status_world:    2;
            uint32_t core_0_dram0_pms_monitor_violate_status_addr:    22;
            uint32_t reserved26                    :    6;
        };
        uint32_t val;
    } core_0_dram0_pms_monitor_2;
    union {
        struct {
            uint32_t core_0_dram0_pms_monitor_violate_status_wr:    1;
            uint32_t core_0_dram0_pms_monitor_violate_status_byteen:    16;
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } core_0_dram0_pms_monitor_3;
    union {
        struct {
            uint32_t core_1_dram0_pms_monitor_lock :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_1_dram0_pms_monitor_0;
    union {
        struct {
            uint32_t core_1_dram0_pms_monitor_violate_clr:    1;
            uint32_t core_1_dram0_pms_monitor_violate_en:    1;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } core_1_dram0_pms_monitor_1;
    union {
        struct {
            uint32_t core_1_dram0_pms_monitor_violate_intr:    1;
            uint32_t core_1_dram0_pms_monitor_violate_status_lock:    1;
            uint32_t core_1_dram0_pms_monitor_violate_status_world:    2;
            uint32_t core_1_dram0_pms_monitor_violate_status_addr:    22;
            uint32_t reserved26                    :    6;
        };
        uint32_t val;
    } core_1_dram0_pms_monitor_2;
    union {
        struct {
            uint32_t core_1_dram0_pms_monitor_violate_status_wr:    1;
            uint32_t core_1_dram0_pms_monitor_violate_status_byteen:    16;
            uint32_t reserved17                    :    15;
        };
        uint32_t val;
    } core_1_dram0_pms_monitor_3;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_lock :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_0;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_world_0_uart:    2;
            uint32_t core_0_pif_pms_constrain_world_0_g0spi_1:    2;
            uint32_t core_0_pif_pms_constrain_world_0_g0spi_0:    2;
            uint32_t core_0_pif_pms_constrain_world_0_gpio:    2;
            uint32_t core_0_pif_pms_constrain_world_0_fe2:    2;
            uint32_t core_0_pif_pms_constrain_world_0_fe:    2;
            uint32_t reserved12                    :    2;
            uint32_t core_0_pif_pms_constrain_world_0_rtc:    2;
            uint32_t core_0_pif_pms_constrain_world_0_io_mux:    2;
            uint32_t reserved18                    :    2;
            uint32_t core_0_pif_pms_constrain_world_0_hinf:    2;
            uint32_t reserved22                    :    2;
            uint32_t core_0_pif_pms_constrain_world_0_misc:    2;
            uint32_t core_0_pif_pms_constrain_world_0_i2c:    2;
            uint32_t core_0_pif_pms_constrain_world_0_i2s0:    2;
            uint32_t core_0_pif_pms_constrain_world_0_uart1:    2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_1;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_world_0_bt:    2;
            uint32_t reserved2                     :    2;
            uint32_t core_0_pif_pms_constrain_world_0_i2c_ext0:    2;
            uint32_t core_0_pif_pms_constrain_world_0_uhci0:    2;
            uint32_t core_0_pif_pms_constrain_world_0_slchost:    2;
            uint32_t core_0_pif_pms_constrain_world_0_rmt:    2;
            uint32_t core_0_pif_pms_constrain_world_0_pcnt:    2;
            uint32_t core_0_pif_pms_constrain_world_0_slc:    2;
            uint32_t core_0_pif_pms_constrain_world_0_ledc:    2;
            uint32_t core_0_pif_pms_constrain_world_0_backup:    2;
            uint32_t reserved20                    :    2;
            uint32_t core_0_pif_pms_constrain_world_0_bb:    2;
            uint32_t core_0_pif_pms_constrain_world_0_pwm0:    2;
            uint32_t core_0_pif_pms_constrain_world_0_timergroup:    2;
            uint32_t core_0_pif_pms_constrain_world_0_timergroup1:    2;
            uint32_t core_0_pif_pms_constrain_world_0_systimer:    2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_2;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_world_0_spi_2:    2;
            uint32_t core_0_pif_pms_constrain_world_0_spi_3:    2;
            uint32_t core_0_pif_pms_constrain_world_0_apb_ctrl:    2;
            uint32_t core_0_pif_pms_constrain_world_0_i2c_ext1:    2;
            uint32_t core_0_pif_pms_constrain_world_0_sdio_host:    2;
            uint32_t core_0_pif_pms_constrain_world_0_can:    2;
            uint32_t core_0_pif_pms_constrain_world_0_pwm1:    2;
            uint32_t core_0_pif_pms_constrain_world_0_i2s1:    2;
            uint32_t core_0_pif_pms_constrain_world_0_uart2:    2;
            uint32_t reserved18                    :    2;
            uint32_t reserved20                    :    2;
            uint32_t core_0_pif_pms_constrain_world_0_rwbt:    2;
            uint32_t reserved24                    :    2;
            uint32_t core_0_pif_pms_constrain_world_0_wifimac:    2;
            uint32_t core_0_pif_pms_constrain_world_0_pwr:    2;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_3;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_world_0_usb_device:    2;
            uint32_t core_0_pif_pms_constrain_world_0_usb_wrap:    2;
            uint32_t core_0_pif_pms_constrain_world_0_crypto_peri:    2;
            uint32_t core_0_pif_pms_constrain_world_0_crypto_dma:    2;
            uint32_t core_0_pif_pms_constrain_world_0_apb_adc:    2;
            uint32_t core_0_pif_pms_constrain_world_0_lcd_cam:    2;
            uint32_t core_0_pif_pms_constrain_world_0_bt_pwr:    2;
            uint32_t core_0_pif_pms_constrain_world_0_usb:    2;
            uint32_t core_0_pif_pms_constrain_world_0_system:    2;
            uint32_t core_0_pif_pms_constrain_world_0_sensitive:    2;
            uint32_t core_0_pif_pms_constrain_world_0_interrupt:    2;
            uint32_t core_0_pif_pms_constrain_world_0_dma_copy:    2;
            uint32_t core_0_pif_pms_constrain_world_0_cache_config:    2;
            uint32_t core_0_pif_pms_constrain_world_0_ad:    2;
            uint32_t core_0_pif_pms_constrain_world_0_dio:    2;
            uint32_t core_0_pif_pms_constrain_world_0_world_controller:    2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_4;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_world_1_uart:    2;
            uint32_t core_0_pif_pms_constrain_world_1_g0spi_1:    2;
            uint32_t core_0_pif_pms_constrain_world_1_g0spi_0:    2;
            uint32_t core_0_pif_pms_constrain_world_1_gpio:    2;
            uint32_t core_0_pif_pms_constrain_world_1_fe2:    2;
            uint32_t core_0_pif_pms_constrain_world_1_fe:    2;
            uint32_t reserved12                    :    2;
            uint32_t core_0_pif_pms_constrain_world_1_rtc:    2;
            uint32_t core_0_pif_pms_constrain_world_1_io_mux:    2;
            uint32_t reserved18                    :    2;
            uint32_t core_0_pif_pms_constrain_world_1_hinf:    2;
            uint32_t reserved22                    :    2;
            uint32_t core_0_pif_pms_constrain_world_1_misc:    2;
            uint32_t core_0_pif_pms_constrain_world_1_i2c:    2;
            uint32_t core_0_pif_pms_constrain_world_1_i2s0:    2;
            uint32_t core_0_pif_pms_constrain_world_1_uart1:    2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_5;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_world_1_bt:    2;
            uint32_t reserved2                     :    2;
            uint32_t core_0_pif_pms_constrain_world_1_i2c_ext0:    2;
            uint32_t core_0_pif_pms_constrain_world_1_uhci0:    2;
            uint32_t core_0_pif_pms_constrain_world_1_slchost:    2;
            uint32_t core_0_pif_pms_constrain_world_1_rmt:    2;
            uint32_t core_0_pif_pms_constrain_world_1_pcnt:    2;
            uint32_t core_0_pif_pms_constrain_world_1_slc:    2;
            uint32_t core_0_pif_pms_constrain_world_1_ledc:    2;
            uint32_t core_0_pif_pms_constrain_world_1_backup:    2;
            uint32_t reserved20                    :    2;
            uint32_t core_0_pif_pms_constrain_world_1_bb:    2;
            uint32_t core_0_pif_pms_constrain_world_1_pwm0:    2;
            uint32_t core_0_pif_pms_constrain_world_1_timergroup:    2;
            uint32_t core_0_pif_pms_constrain_world_1_timergroup1:    2;
            uint32_t core_0_pif_pms_constrain_world_1_systimer:    2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_6;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_world_1_spi_2:    2;
            uint32_t core_0_pif_pms_constrain_world_1_spi_3:    2;
            uint32_t core_0_pif_pms_constrain_world_1_apb_ctrl:    2;
            uint32_t core_0_pif_pms_constrain_world_1_i2c_ext1:    2;
            uint32_t core_0_pif_pms_constrain_world_1_sdio_host:    2;
            uint32_t core_0_pif_pms_constrain_world_1_can:    2;
            uint32_t core_0_pif_pms_constrain_world_1_pwm1:    2;
            uint32_t core_0_pif_pms_constrain_world_1_i2s1:    2;
            uint32_t core_0_pif_pms_constrain_world_1_uart2:    2;
            uint32_t reserved18                    :    2;
            uint32_t reserved20                    :    2;
            uint32_t core_0_pif_pms_constrain_world_1_rwbt:    2;
            uint32_t reserved24                    :    2;
            uint32_t core_0_pif_pms_constrain_world_1_wifimac:    2;
            uint32_t core_0_pif_pms_constrain_world_1_pwr:    2;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_7;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_world_1_usb_device:    2;
            uint32_t core_0_pif_pms_constrain_world_1_usb_wrap:    2;
            uint32_t core_0_pif_pms_constrain_world_1_crypto_peri:    2;
            uint32_t core_0_pif_pms_constrain_world_1_crypto_dma:    2;
            uint32_t core_0_pif_pms_constrain_world_1_apb_adc:    2;
            uint32_t core_0_pif_pms_constrain_world_1_lcd_cam:    2;
            uint32_t core_0_pif_pms_constrain_world_1_bt_pwr:    2;
            uint32_t core_0_pif_pms_constrain_world_1_usb:    2;
            uint32_t core_0_pif_pms_constrain_world_1_system:    2;
            uint32_t core_0_pif_pms_constrain_world_1_sensitive:    2;
            uint32_t core_0_pif_pms_constrain_world_1_interrupt:    2;
            uint32_t core_0_pif_pms_constrain_world_1_dma_copy:    2;
            uint32_t core_0_pif_pms_constrain_world_1_cache_config:    2;
            uint32_t core_0_pif_pms_constrain_world_1_ad:    2;
            uint32_t core_0_pif_pms_constrain_world_1_dio:    2;
            uint32_t core_0_pif_pms_constrain_world_1_world_controller:    2;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_8;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_rtcfast_spltaddr_world_0:    11;
            uint32_t core_0_pif_pms_constrain_rtcfast_spltaddr_world_1:    11;
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_9;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_rtcfast_world_0_l:    3;
            uint32_t core_0_pif_pms_constrain_rtcfast_world_0_h:    3;
            uint32_t core_0_pif_pms_constrain_rtcfast_world_1_l:    3;
            uint32_t core_0_pif_pms_constrain_rtcfast_world_1_h:    3;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_10;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_rtcslow_0_spltaddr_world_0:    11;
            uint32_t core_0_pif_pms_constrain_rtcslow_0_spltaddr_world_1:    11;
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_11;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_rtcslow_0_world_0_l:    3;
            uint32_t core_0_pif_pms_constrain_rtcslow_0_world_0_h:    3;
            uint32_t core_0_pif_pms_constrain_rtcslow_0_world_1_l:    3;
            uint32_t core_0_pif_pms_constrain_rtcslow_0_world_1_h:    3;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_12;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_rtcslow_1_spltaddr_world_0:    11;
            uint32_t core_0_pif_pms_constrain_rtcslow_1_spltaddr_world_1:    11;
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_13;
    union {
        struct {
            uint32_t core_0_pif_pms_constrain_rtcslow_1_world_0_l:    3;
            uint32_t core_0_pif_pms_constrain_rtcslow_1_world_0_h:    3;
            uint32_t core_0_pif_pms_constrain_rtcslow_1_world_1_l:    3;
            uint32_t core_0_pif_pms_constrain_rtcslow_1_world_1_h:    3;
            uint32_t reserved12                    :    20;
        };
        uint32_t val;
    } core_0_pif_pms_constrain_14;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_lock:    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_0_region_pms_constrain_0;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_world_0_area_0:    2;
            uint32_t core_0_region_pms_constrain_world_0_area_1:    2;
            uint32_t core_0_region_pms_constrain_world_0_area_2:    2;
            uint32_t core_0_region_pms_constrain_world_0_area_3:    2;
            uint32_t core_0_region_pms_constrain_world_0_area_4:    2;
            uint32_t core_0_region_pms_constrain_world_0_area_5:    2;
            uint32_t core_0_region_pms_constrain_world_0_area_6:    2;
            uint32_t core_0_region_pms_constrain_world_0_area_7:    2;
            uint32_t core_0_region_pms_constrain_world_0_area_8:    2;
            uint32_t core_0_region_pms_constrain_world_0_area_9:    2;
            uint32_t core_0_region_pms_constrain_world_0_area_10:    2;
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_0_region_pms_constrain_1;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_world_1_area_0:    2;
            uint32_t core_0_region_pms_constrain_world_1_area_1:    2;
            uint32_t core_0_region_pms_constrain_world_1_area_2:    2;
            uint32_t core_0_region_pms_constrain_world_1_area_3:    2;
            uint32_t core_0_region_pms_constrain_world_1_area_4:    2;
            uint32_t core_0_region_pms_constrain_world_1_area_5:    2;
            uint32_t core_0_region_pms_constrain_world_1_area_6:    2;
            uint32_t core_0_region_pms_constrain_world_1_area_7:    2;
            uint32_t core_0_region_pms_constrain_world_1_area_8:    2;
            uint32_t core_0_region_pms_constrain_world_1_area_9:    2;
            uint32_t core_0_region_pms_constrain_world_1_area_10:    2;
            uint32_t reserved22                    :    10;
        };
        uint32_t val;
    } core_0_region_pms_constrain_2;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_addr_0:    30;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_region_pms_constrain_3;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_addr_1:    30;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_region_pms_constrain_4;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_addr_2:    30;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_region_pms_constrain_5;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_addr_3:    30;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_region_pms_constrain_6;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_addr_4:    30;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_region_pms_constrain_7;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_addr_5:    30;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_region_pms_constrain_8;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_addr_6:    30;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_region_pms_constrain_9;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_addr_7:    30;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_region_pms_constrain_10;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_addr_8:    30;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_region_pms_constrain_11;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_addr_9:    30;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_region_pms_constrain_12;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_addr_10:    30;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_region_pms_constrain_13;
    union {
        struct {
            uint32_t core_0_region_pms_constrain_addr_11:    30;
            uint32_t reserved30                    :    2;
        };
        uint32_t val;
    } core_0_region_pms_constrain_14;
    union {
        struct {
            uint32_t core_0_pif_pms_monitor_lock   :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_0_pif_pms_monitor_0;
    union {
        struct {
            uint32_t core_0_pif_pms_monitor_violate_clr:    1;
            uint32_t core_0_pif_pms_monitor_violate_en:    1;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } core_0_pif_pms_monitor_1;
    union {
        struct {
            uint32_t core_0_pif_pms_monitor_violate_intr:    1;
            uint32_t core_0_pif_pms_monitor_violate_status_hport_0:    1;
            uint32_t core_0_pif_pms_monitor_violate_status_hsize:    3;
            uint32_t core_0_pif_pms_monitor_violate_status_hwrite:    1;
            uint32_t core_0_pif_pms_monitor_violate_status_hworld:    2;
            uint32_t reserved8                     :    24;
        };
        uint32_t val;
    } core_0_pif_pms_monitor_2;
    uint32_t core_0_pif_pms_monitor_3;
    union {
        struct {
            uint32_t core_0_pif_pms_monitor_nonword_violate_clr:    1;
            uint32_t core_0_pif_pms_monitor_nonword_violate_en:    1;
            uint32_t reserved2                     :    30;
        };
        uint32_t val;
    } core_0_pif_pms_monitor_4;
    union {
        struct {
            uint32_t core_0_pif_pms_monitor_nonword_violate_intr:    1;
            uint32_t core_0_pif_pms_monitor_nonword_violate_status_hsize:    2;
            uint32_t core_0_pif_pms_monitor_nonword_violate_status_hworld:    2;
            uint32_t reserved5                     :    27;
        };
        uint32_t val;
    } core_0_pif_pms_monitor_5;
    uint32_t core_0_pif_pms_monitor_6;
    union {
        struct {
            uint32_t core_0_vecbase_override_lock  :    1;
            uint32_t reserved1                     :    31;
        };
        uint32_t val;
    } core_0_vecbase_override_lock;
    union {
        struct {
